//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
friends.length >= 3 ? document.write('Массив великий. 3 і більше єлементів') : document.write('Массив малий. Менше 3 єлементів');
document.write('<br>');


//------------------------------------------------------------------------------------------------------------------------------
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
let first = 12;
let second = 10;
let third = 11;
//-------- вибирає середнє число із будь-яких трьох
if (first < second && first > third || first < third && first > second) {
    document.write(`середнє число ${first}`);
} else if (second < first && second > third || second < third && second > first) {
    document.write(`середнє число ${second}`);
} else if (first > third && second < third || second > third && first < third) {
    document.write(`середнє число ${third}`);
}


//-------------------------------------------------------------------------------------------------------------------------------
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let result, a, b;
a + b < 4 ? result = 'мало' : result = 'Багато';


//------------------------------------------------------------------------------------------------------------------------------
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let num = 123;
num > 0 ? alert('позитивне') : num < 0 ? alert('негативне') : alert('дорівнює нулю');